<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image and builds a package, copying your
'distribution/policies.json' file into the application bundle. Adapted from 
Greg Neagle's FirefoxAutoconfig.pkg recipe.
Adapted from neilmartin83's FirefoxPolicies.pkg.recipe for use in the dal libraries
Create a 'distribution' directory in the same directory as the recipe
and copy your policies.json file there. Firefox versions below 60 are not 
supported by this recipe. ORG_NAME is inserted into the pkg name to distinguish 
a vanilla "Firefox-60.0.pkg" from "Firefox_PretendCo-60.0.pkg". You might 
consider setting a unique PKG_ID to differentiate your org's "flavor" of Firefox.

Values for RELEASE correspond to directories here: 
    http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are: 
    'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
LOCALE corresponds to directories at 
    http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
Examples include 'en_GB', 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'

No idea if all Firefox builds are available in all the same localizations, 
so you may need to verify that any particular combination is offered.</string>
    <key>Identifier</key>
    <string>com.github.gperkinsdal.pkg.FirefoxPolicies-Dallibs</string>
    <key>Input</key>
    <dict>
        <key>RELEASE</key>
        <string>latest-esr</string>
        <key>LOCALE</key>
        <string>en_US</string>
        <key>NAME</key>
        <string>Firefox</string>
        <key>ORG_NAME</key>
        <string>Dallibs</string>
        <key>PKG_ID</key>
        <string>dallibs.org.mozilla.firefox.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.firefox-rc-en_US</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/Firefox.app</string>
                <key>source_path</key>
                <string>%pathname%/Firefox.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/Firefox.app/Contents/Resources/distribution</string>
                <key>source_path</key>
                <string>%RECIPE_DIR%/dallibs/distribution</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                </dict>
                <key>pkgname</key>
                <string>%NAME%_%ORG_NAME%-%version%</string>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
