<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image, builds a package, including autoconfig 
resources (typically as generated via the CCK2 tool), then imports the pkg into
your Munki repo.

Place the autoconfig.zip  in the same directory as the recipe. You may 
optionally use a different name by setting AUTOCONFIG_FILENAME.
Firefox 35 and later require an AUTOCONFIG_DIR of "Contents/Resources"; 
pre-34 requires "Content/MacOS". Firefox 34 is not supported by this recipe. 
ORG_NAME is inserted into the pkg name to distinguish a vanilla 
"Firefox-35.0.pkg" from "Firefox_PretendCo-35.0.pkg". You might consider setting
a unique PKG_ID to differentiate your org's "flavor" of Firefox.

Values for RELEASE correspond to directories here: 
    http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are: 
    'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
LOCALE corresponds to directories at 
    http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'

No idea if all Firefox builds are available in all the same localizations, 
so you may need to verify that any particular combination is offered.

Altered to use JSON Files for the Dalhousie Libraries, by Graham Perkins</string>
    <key>Identifier</key>
    <string>com.github.gperkinsdal.munki.FirefoxPolicies-Dallibs-sxt</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/firefox</string>
        <key>NAME</key>
        <string>Firefox_dallibs-sxt</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Mozilla Firefox is a free and open source web browser.</string>
            <key>display_name</key>
            <string>Mozilla Firefox for the Dalhousie Libraries</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gperkinsdal.pkg.FirefoxPolicies-Dallibs-sxt</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>